ATARI/singleSolver/0/region0/neutronTransport/fluxDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/neutronTransport";
    object      fluxDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -2 -1 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    ".*"
    {
        type            albedo;
        gamma           0.5; // defined as (1-alpha)/(1+alpha)/2, alpha being the albedo coefficient
        value           uniform 1;
    }
}


// ************************************************************************* //
