ATARI/singleSolver/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.0003/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    vessel
    {
        type            wall;
        inGroups        
2
(
clearWall
wall
)
;
        nFaces          17406;
        startFace       586156;
    }
    inlet0
    {
        type            patch;
        inGroups        1(inlets);
        nFaces          312;
        startFace       603562;
    }
    inlet1
    {
        type            patch;
        inGroups        1(inlets);
        nFaces          312;
        startFace       603874;
    }
    inlet2
    {
        type            patch;
        inGroups        1(inlets);
        nFaces          312;
        startFace       604186;
    }
    inlet3
    {
        type            patch;
        inGroups        1(inlets);
        nFaces          312;
        startFace       604498;
    }
    outlet0
    {
        type            patch;
        inGroups        1(outlets);
        nFaces          150;
        startFace       604810;
    }
    outlet1
    {
        type            patch;
        inGroups        1(outlets);
        nFaces          150;
        startFace       604960;
    }
    outlet2
    {
        type            patch;
        inGroups        1(outlets);
        nFaces          150;
        startFace       605110;
    }
    outlet3
    {
        type            patch;
        inGroups        1(outlets);
        nFaces          150;
        startFace       605260;
    }
    baffle0
    {
        type            wall;
        inGroups        
2
(
wall
baffles
)
;
        nFaces          130640;
        startFace       605410;
    }
)

// ************************************************************************* //
