ATARI/singleSolver/constant/region0/neutronTransport/reactorState
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant/region0/neutronTransport";
    object          reactorState;
}

keff            1;

normalizationPower 3e+09;


// ************************************************************************* //
