ATARI/singleSolver/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         singleSolver;

startFrom           startTime;
// startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             50;

deltaT              0.01;

adjustTimeStep      false;

maxDeltaT           1.0;

writeControl        runTime;
// writeControl        adjustableRunTime;
// writeControl        timeStep;

writeInterval       0.2;
// writeInterval       1;

purgeWrite          2;
// purgeWrite          0;

writeFormat         ascii;

writePrecision      7;

writeCompression    false;

timeFormat          general;

timePrecision       8;

runTimeModifiable   true;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Solution control

maxCo               1;

// maxPowerVariation   0.025; //max power variation in each time step

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    #includeFunc CourantNo
    // #includeFunc writeObject
}


// ************************************************************************* //
