ATARI/singleSolver/system/region0/neutronTransport/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    discFlux
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-6;
        relTol          1e-2;
    }

    precursor
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          1e-2;
    }
}

PIMPLE
{
    implicitPredictor           false;
    integralPredictor           false;
    ROMAcceleration             false;
    aitkenAcceleration          false;

    neutronicsOnFinalIterOnly   true;

    outerCorrectorResidualControl
    {
        "discFlux.*"
        {
            tolerance   1e-3;
            relTol      0;
        }
    }
}


// ************************************************************************* //
